In [22]:
import pandas as pd
df = pd.DataFrame({'name':["Ram","Shyam","Mukesh","Suresh"],'age':[10,18,60,50]})
df

     name  age
0     Ram   10
1   Shyam   18
2  Mukesh   60
3  Suresh   50

In [23]:
df['age']

0    10
1    18
2    60
3    50
Name: age, dtype: int64

In [24]:
#import pandas as pd
def replace_ages(a):
    '''a is a dataframe with columns ['name', 'age']
       Output A dataframe with same columns but with changed records as per required is expected to be returned'''

    # YOUR CODE GOES HERE
    def categorize(age_value):
        if age_value < 18 : return 'kid'
        elif 18 <= age_value < 50 : return 'adult'
        else : return 'senior'

    a['age'] = a['age'].apply(categorize)
    return a

In [25]:
replace_ages(df)

     name     age
0     Ram     kid
1   Shyam   adult
2  Mukesh  senior
3  Suresh  senior